zlgopen/ametal/soc/hdsc/drivers/source/can/am_hc32f07x_can.c
/*******************************************************************************
*                                 AMetal
*                       ----------------------------
*                       innovating embedded platform
*
* Copyright (c) 2001-2015 Guangzhou ZHIYUAN Electronics Stock Co., Ltd.
* All rights reserved.
*
* Contact information:
* web site:    http://www.zlg.cn/
* e-mail:      apollo.support@zlg.cn
*******************************************************************************/

/**
 * \file
 * \brief  CAN驱动层实现
 */

#include "am_int.h"
#include "am_can.h"
#include "am_hc32f07x_can.h"
#include "hw/amhw_hc32f07x_can.h"
#include "hc32f07x_inum.h"
#include "am_vdebug.h"
/** \brief CAN启动 */
am_can_err_t __can_hc32f07x_start (void *p_drv);
/** \brief CAN复位（停止） */
am_can_err_t __can_hc32f07x_reset (void *p_drv);
///** \brief CAN休眠  */
//am_can_err_t __can_hc32f07x_sleep (void *p_drv);
///** \brief CAN唤醒 */
//am_can_err_t __can_hc32f07x_wakeup (void *p_drv);
/** \brief 中断使能 */
am_can_err_t __can_hc32f07x_int_enable (void *p_drv, am_can_int_type_t int_mask);
/** \brief 中断禁能*/
am_can_err_t __can_hc32f07x_int_disable (void *p_drv, am_can_int_type_t int_mask);
/** \brief 模式设置 */
am_can_err_t __can_hc32f07x_mode_set (void *p_drv, am_can_mode_type_t mode);
/** \brief 波特率设置 */
am_can_err_t __can_hc32f07x_baudrate_set (void               *p_drv,
                                 am_can_bps_param_t *p_can_baudrate);
/** \brief 波特率获取 */
am_can_err_t __can_hc32f07x_baudrate_get (void               *p_drv,
                                 am_can_bps_param_t *p_can_baudrate);
/** \brief 获取错误计数 */
am_can_err_t __can_hc32f07x_err_cnt_get (void         *p_drv,
                                 am_can_err_cnt_t   *p_can_err_reg);
/** \brief 发送信息   */
am_can_err_t __can_hc32f07x_msg_send (void *p_drv, am_can_message_t *p_txmsg);
/** \brief 接收信息   */
am_can_err_t __can_hc32f07x_msg_recv (void *p_drv, am_can_message_t *p_rxmsg);
/** \brief 停止发送信息   */
am_can_err_t __can_hc32f07x_stop_msg_snd (void *p_drv);

/** \brief CAN 状态 */
am_can_err_t __can_hc32f07x_status_get (void              *p_drv,
                               am_can_int_type_t *p_int_type,
                               am_can_bus_err_t  *p_bus_err);
/** \brief 中断连接 */
am_can_err_t __can_hc32f07x_connect (void         *p_drv,
                            am_pfnvoid_t  pfn_isr,
                            void         *p_arg);
/** \brief 删除中断连接 */
am_can_err_t __can_hc32f07x_disconnect (void         *p_drv,
                               am_pfnvoid_t  pfn_isr,
                               void         *p_arg);
/** \brief 中断回调函数的连接 */
am_can_err_t __can_hc32f07x_intcb_connect (void              *p_drv,
                                  am_can_int_type_t  inttype,
                                  am_pfnvoid_t       pfn_callback,
                                  void              *p_arg);


/** \brief 删除中断回调函数的连接 */
am_can_err_t __can_hc32f07x_intcb_disconnect (void              *p_drv,
                                            am_can_int_type_t  inttype);

/** \brief 设置滤波函数 (扩展)*/
am_can_err_t __can_hc32f07x_filter_tab_ext_set (void            *p_drv,
                                              am_can_filter_t *p_filterbuff,
                                              size_t           lenth);
/** \brief 获取滤波函数 (扩展)*/
am_can_err_t __can_hc32f07x_filter_tab_ext_get (void             *p_drv,
                                              am_can_filter_t  *p_filterbuff,
                                              size_t           *p_lenth);

struct am_can_drv_funcs __hc32f07x_can_dev_func = {
    __can_hc32f07x_start,
    __can_hc32f07x_reset,
    NULL,
    NULL,
    __can_hc32f07x_int_enable,
    __can_hc32f07x_int_disable,
    __can_hc32f07x_mode_set,
    __can_hc32f07x_baudrate_set,
    __can_hc32f07x_baudrate_get,
    __can_hc32f07x_err_cnt_get,
    NULL,
    __can_hc32f07x_msg_send,
    __can_hc32f07x_msg_recv,
    __can_hc32f07x_stop_msg_snd,
    NULL,
    NULL,
    __can_hc32f07x_status_get,
    __can_hc32f07x_connect,
    __can_hc32f07x_disconnect,
    __can_hc32f07x_intcb_connect,
    __can_hc32f07x_intcb_disconnect,
    __can_hc32f07x_filter_tab_ext_set,
    __can_hc32f07x_filter_tab_ext_get,
};

/**
 * \brief CAN初始化
 */
uint8_t __can_hc32f07x_init (void *p_drv)
{
    am_hc32f07x_can_dev_t        *p_dev       = (am_hc32f07x_can_dev_t *)p_drv;
    amhw_hc32f07x_can_t          *p_hw_can    = NULL;
    am_hc32f07x_can_init_info_t  *p_can_info  = NULL;
    uint8_t                     init_staus  = 0;

    if (NULL == p_drv) {
        return AM_CAN_INVALID_PARAMETER;
    }

    p_can_info =(am_hc32f07x_can_init_info_t *)p_dev->p_devinfo->init_info;
    p_hw_can   =(amhw_hc32f07x_can_t *)p_dev->p_devinfo->regbase;

    /* 时间触发通信方式设定 */
    if(p_can_info->can_ttcm){
        amhw_hc32f07x_can_tt_enable(p_hw_can);
    }else {
        amhw_hc32f07x_can_tt_disable(p_hw_can);
    }

    /* 设置接收缓冲器数据存储模式 */
    if (p_can_info->rx_all) {
        amhw_hc32f07x_can_rxbuf_stores_all_set(p_hw_can,
                                               AMHW_HC32F07X_CAN_RXBUF_ALL);
    } else {
        amhw_hc32f07x_can_rxbuf_stores_all_set(p_hw_can,
                                              AMHW_HC32F07X_CAN_RXBUF_NORMAL);
    }

    /* 设置接收缓冲器上溢模式 */
    if (p_can_info->over_mode) {
        amhw_hc32f07x_can_rxbuf_over_mode_set(p_hw_can,
                                            AMHW_HC32F07X_CAN_RXBUF_NOTSTORED);
    } else {
        amhw_hc32f07x_can_rxbuf_over_mode_set (p_hw_can,
                                          AMHW_HC32F07X_CAN_RXBUF_OVERWRITTEN);
    }

    /* 设置缓冲器发送模式 */
    if (p_can_info->can_stb_mode) {
        amhw_hc32f07x_can_stb_mode_set(p_hw_can, 
                                       AMHW_HC32F07X_CAN_STB_MODE_PRIM);
    } else {
        amhw_hc32f07x_can_stb_mode_set(p_hw_can, 
                                       AMHW_HC32F07X_CAN_STB_MODE_FIFO);
    }

    /* 接收缓冲器将满设定值 */
    amhw_hc32f07x_can_rxbuf_warning_set(p_hw_can, 
                                        p_can_info->warning_limitval);

    /* 错误警告限定值 */
    amhw_hc32f07x_can_err_warning_set (p_hw_can, 
                                       p_can_info->error_warning_limitval);
    /* 关闭所有中断 */
    amhw_hc32f07x_can_int_all_disable (p_hw_can);

    return init_staus;
}


/**
 * \brief CAN启动
 */
am_can_err_t __can_hc32f07x_start (void *p_drv)
{
am_hc32f07x_can_dev_t    *p_dev    = (am_hc32f07x_can_dev_t *)p_drv;
    if (NULL == p_drv) {
        return AM_CAN_INVALID_PARAMETER;
    }

    /* 初始化CAN控制信息 */
    __can_hc32f07x_init(p_drv);

