zlgopen/ametal/soc/hdsc/drivers/source/can/am_hc32f07x_can.c
    /* 使能中断 */
    am_int_enable(p_dev->p_devinfo->int_num );

    return AM_CAN_NOERROR;
}

/**
 * \brief CAN复位（停止）
 */
am_can_err_t __can_hc32f07x_reset (void *p_drv)
{
    am_hc32f07x_can_dev_t    *p_dev    = (am_hc32f07x_can_dev_t *)p_drv;
    amhw_hc32f07x_can_t      *p_hw_can = NULL;

    if (NULL == p_drv) {
        return AM_CAN_INVALID_PARAMETER;
    }

    p_hw_can = (amhw_hc32f07x_can_t *)p_dev->p_devinfo->regbase;

    /* 对CAN强制复位 */
    amhw_hc32f07x_can_reset_set (p_hw_can);


    /* 禁能中断 */
    am_int_disable(INUM_CAN);

    return AM_CAN_NOERROR;
}


/**
 * \brief 中断使能
 */
am_can_err_t __can_hc32f07x_int_enable (void *p_drv, am_can_int_type_t int_mask)
{
    am_hc32f07x_can_dev_t             *p_dev    = (am_hc32f07x_can_dev_t *)p_drv;
    amhw_hc32f07x_can_t               *p_hw_can = NULL;

    if (NULL == p_drv) {
        return AM_CAN_INVALID_PARAMETER;
    }

    p_hw_can = (amhw_hc32f07x_can_t *)p_dev->p_devinfo->regbase;

    /* 接收中断 */
    if (int_mask & AM_CAN_INT_RX) {

        /* 使能接收中断 */
        amhw_hc32f07x_can_int_enable (p_hw_can, AMHW_HC32F07X_CAN_INT_RECV);

        int_mask &= ~AM_CAN_INT_RX;
    }

    /* 发送中断 */
    if (int_mask & AM_CAN_INT_TX) {
			
        /* 使能PTB发送中断 */
        amhw_hc32f07x_can_int_enable (p_hw_can, AMHW_HC32F07X_CAN_INT_TX_PTB);

        /* 使能STB发送中断 */
        amhw_hc32f07x_can_int_enable (p_hw_can, AMHW_HC32F07X_CAN_INT_TX_STB);

        int_mask &= ~AM_CAN_INT_TX;
    }

    /* 错误\警告中断  */
    if ((int_mask & AM_CAN_INT_ERROR) || (int_mask & AM_CAN_INT_WARN)) {

        /* 使能错误中断 */
        amhw_hc32f07x_can_int_enable(p_hw_can, AMHW_HC32F07X_CAN_INT_ERROR);

        /* 使能总线错误中断 */
        amhw_hc32f07x_can_int_enable(p_hw_can, AMHW_HC32F07X_CAN_INT_BUS_ERR);

        /* 使能仲裁失败中断 */
        amhw_hc32f07x_can_int_enable(p_hw_can, AMHW_HC32F07X_CAN_INT_ARBILOST);

        int_mask &= ~AM_CAN_INT_ERROR;
    }

    /* 错误被动中断  */
    if ((int_mask & AM_CAN_INT_ERROR_PASSIVE)) {

        /* 使能错误被动中断  */
        amhw_hc32f07x_can_int_enable (p_hw_can, AMHW_HC32F07X_CAN_INT_PASSIVE);

        int_mask &= ~AM_CAN_INT_ERROR_PASSIVE;
    }

    /* 总线超载中断 */
    if (int_mask & AM_CAN_INT_DATAOVER) {

        /* 使能接收上溢中断  */
        amhw_hc32f07x_can_int_enable(p_hw_can, AMHW_HC32F07X_CAN_INT_RX_OVER);

        /* 使能接收满中断  */
        amhw_hc32f07x_can_int_enable(p_hw_can, AMHW_HC32F07X_CAN_INT_RX_FULL);

        /* 使能接收将满中断  */
        amhw_hc32f07x_can_int_enable(p_hw_can, 
                                     AMHW_HC32F07X_CAN_INT_RX_ALMOSTFULL);

        int_mask &= ~AM_CAN_INT_DATAOVER;
    }

    return AM_CAN_NOERROR;
}

/**
 * \brief 中断禁能
 */
am_can_err_t __can_hc32f07x_int_disable (void *p_drv, am_can_int_type_t int_mask)
{
    am_hc32f07x_can_dev_t         *p_dev    = (am_hc32f07x_can_dev_t *)p_drv;
    amhw_hc32f07x_can_t           *p_hw_can = NULL;

    if (NULL == p_drv) {
        return AM_CAN_INVALID_PARAMETER;
    }

    p_hw_can = (amhw_hc32f07x_can_t *)p_dev->p_devinfo->regbase;


   /* 接收中断 */
    if (int_mask & AM_CAN_INT_RX) {

        /* 禁能接收中断 */
        amhw_hc32f07x_can_int_disable (p_hw_can, AMHW_HC32F07X_CAN_INT_RECV);

        int_mask &= ~AM_CAN_INT_RX;
    }

    /* 发送中断 */
    if (int_mask & AM_CAN_INT_TX) {

        /* 禁能PTB发送中断 */
        amhw_hc32f07x_can_int_disable (p_hw_can, AMHW_HC32F07X_CAN_INT_TX_PTB);

        /* 使能STB发送中断 */
        amhw_hc32f07x_can_int_disable (p_hw_can, AMHW_HC32F07X_CAN_INT_TX_STB);

        int_mask &= ~AM_CAN_INT_TX;
    }

    /* 错误\警告中断  */
   if ((int_mask & AM_CAN_INT_ERROR) || (int_mask & AM_CAN_INT_WARN)) {

        /* 禁能错误中断 */
        amhw_hc32f07x_can_int_disable(p_hw_can, AMHW_HC32F07X_CAN_INT_ERROR);

        /* 禁能总线错误中断 */
        amhw_hc32f07x_can_int_disable(p_hw_can, AMHW_HC32F07X_CAN_INT_BUS_ERR);

        /* 禁能仲裁失败中断 */
        amhw_hc32f07x_can_int_disable(p_hw_can, AMHW_HC32F07X_CAN_INT_ARBILOST);

        int_mask &= ~AM_CAN_INT_ERROR;
    }

    /* 错误被动中断  */
    if ((int_mask & AM_CAN_INT_ERROR_PASSIVE)) {

        /* 禁能错误被动中断  */
        amhw_hc32f07x_can_int_disable(p_hw_can, AMHW_HC32F07X_CAN_INT_PASSIVE);

        int_mask &= ~AM_CAN_INT_ERROR_PASSIVE;
    }

    /* 总线超载中断 */
    if (int_mask & AM_CAN_INT_DATAOVER) {

        /* 禁能接收上溢中断  */
        amhw_hc32f07x_can_int_disable(p_hw_can, AMHW_HC32F07X_CAN_INT_RX_OVER);

        /* 禁能接收满中断  */
        amhw_hc32f07x_can_int_disable(p_hw_can, AMHW_HC32F07X_CAN_INT_RX_FULL);

        /* 禁能接收将满中断  */
        amhw_hc32f07x_can_int_disable(p_hw_can, 
                                      AMHW_HC32F07X_CAN_INT_RX_ALMOSTFULL);

        int_mask &= ~AM_CAN_INT_DATAOVER;
    }

    return AM_CAN_NOERROR;
}

/**
 * \brief 模式设置
 */
am_can_err_t __can_hc32f07x_mode_set (void *p_drv, am_can_mode_type_t mode)
{
    am_hc32f07x_can_dev_t *p_dev    = (am_hc32f07x_can_dev_t *)p_drv;
    amhw_hc32f07x_can_t   *p_hw_can = NULL;

    if (NULL == p_drv) {
        return AM_CAN_INVALID_PARAMETER;
    }

    p_hw_can = (amhw_hc32f07x_can_t *)p_dev->p_devinfo->regbase;

    if (AM_CAN_MODE_NROMAL == mode ) {

        /* 正常模式 */
        amhw_hc32f07x_can_mode_disable (p_hw_can,
                                        AMHW_HC32F07X_CAN_LISTEN_ONLY_MODE);
        amhw_hc32f07x_can_mode_disable (p_hw_can,
                                        AMHW_HC32F07X_CAN_EXT_LOOPBACK_MODE);
        amhw_hc32f07x_can_mode_disable (p_hw_can,
                                        AMHW_HC32F07X_CAN_INT_LOOPBACK_MODE);
        amhw_hc32f07x_can_mode_disable (p_hw_can,
                                        AMHW_HC32F07X_CAN_SIG_PRIARY_MODE);
        amhw_hc32f07x_can_mode_disable (p_hw_can,
                                        AMHW_HC32F07X_CAN_SIG_SECONDARY_MODE);
    }else if (AM_CAN_MODE_LISTEN_ONLY == mode) {

        /* 静默模式*/
        amhw_hc32f07x_can_mode_enable (p_hw_can,
                                       AMHW_HC32F07X_CAN_LISTEN_ONLY_MODE);
    }else {

        /* 回环 和 回环静默未设置 */
    }

    return AM_CAN_NOERROR;
}

/**
 * \brief 波特率设置
 */
am_can_err_t __can_hc32f07x_baudrate_set (void           *p_drv,
                                 am_can_bps_param_t    *p_can_baudrate)
{
    am_hc32f07x_can_dev_t         *p_dev    = (am_hc32f07x_can_dev_t *)p_drv;
    amhw_hc32f07x_can_t           *p_hw_can = NULL;

