zlgopen/ametal/soc/hdsc/drivers/source/can/am_hc32f07x_can.c
    if (NULL == p_drv || NULL == p_can_baudrate) {
        return AM_CAN_INVALID_PARAMETER;
    }

    p_hw_can = (amhw_hc32f07x_can_t *)p_dev->p_devinfo->regbase;

    /* 波特率寄存器只在复位模式下可进行访问，设置前进入复位模式  */
    amhw_hc32f07x_can_reset_set(p_hw_can);

    /* 设置 波特率分频器   同步跳转宽度   和相位段 */
    amhw_hc32f07x_can_brp_set(p_hw_can, p_can_baudrate->brp);
    amhw_hc32f07x_can_sjw_set(p_hw_can, p_can_baudrate->sjw);

    amhw_hc32f07x_can_tseg1_set(p_hw_can, p_can_baudrate->tesg1);
    amhw_hc32f07x_can_tseg2_set(p_hw_can, p_can_baudrate->tesg2);

    /* 退出复位模式 */
    amhw_hc32f07x_can_reset_clr(p_hw_can);

    return AM_CAN_NOERROR;
}

/**
 * \brief 波特率获取
 */
am_can_err_t __can_hc32f07x_baudrate_get (void           *p_drv,
                                 am_can_bps_param_t    *p_can_baudrate)
{
    am_hc32f07x_can_dev_t         *p_dev    = (am_hc32f07x_can_dev_t *)p_drv;
    amhw_hc32f07x_can_t           *p_hw_can = NULL;

    if (NULL == p_drv || NULL == p_can_baudrate) {
        return AM_CAN_INVALID_PARAMETER;
    }

    /* 波特率寄存器只在初始化模式下可进行访问，设置前进入初始化模式  */
    amhw_hc32f07x_can_reset_set(p_hw_can);

    p_hw_can = (amhw_hc32f07x_can_t *)p_dev->p_devinfo->regbase;

    p_can_baudrate->brp = amhw_hc32f07x_can_brp_get(p_hw_can);
    p_can_baudrate->sjw = amhw_hc32f07x_can_sjw_get(p_hw_can);

    p_can_baudrate->tesg1 = amhw_hc32f07x_can_tseg1_get(p_hw_can);
    p_can_baudrate->tesg2 = amhw_hc32f07x_can_tseg2_get(p_hw_can);

    amhw_hc32f07x_can_reset_set(p_hw_can);

    return AM_CAN_NOERROR;
}

/**
 * \brief 获取错误计数
 */
am_can_err_t __can_hc32f07x_err_cnt_get (void        *p_drv,
                               am_can_err_cnt_t    *p_can_err_reg)
{
    am_hc32f07x_can_dev_t *p_dev    = (am_hc32f07x_can_dev_t *)p_drv;
    amhw_hc32f07x_can_t   *p_hw_can = NULL;

    if (NULL == p_drv || NULL == p_can_err_reg) {
        return AM_CAN_INVALID_PARAMETER;
    }

    p_hw_can = (amhw_hc32f07x_can_t *)p_dev->p_devinfo->regbase;

    /* 读 TX/RX错误计数器 */
    p_can_err_reg->rx_error_cnt = amhw_hc32f07x_can_get_recverrorcount(p_hw_can);
    p_can_err_reg->tx_error_cnt = amhw_hc32f07x_can_get_transerrorcount(p_hw_can);

    return AM_CAN_NOERROR;
}


/**
 * \brief 发送信息
 */
am_can_err_t __can_hc32f07x_msg_send (void *p_drv, am_can_message_t *p_txmsg)
{
    
    am_hc32f07x_can_dev_t    *p_dev     = (am_hc32f07x_can_dev_t *)p_drv;
    amhw_hc32f07x_can_t      *p_hw_can  = NULL;
    amhw_hc32f07x_can_type_t  can_type;
    am_bool_t                 is_remote = AM_FALSE;
    am_bool_t                 is_extern = AM_FALSE;

    if (NULL == p_drv || NULL == p_txmsg) {
        return AM_CAN_INVALID_PARAMETER;
    }

    p_hw_can = (amhw_hc32f07x_can_t *)p_dev->p_devinfo->regbase;
    can_type = p_dev->p_devinfo->type;

    /* 判断发送缓冲区是否被释放 */
    if (AMHW_HC32F07X_CAN_TB_FULL == amhw_hc32f07x_can_get_tb_status(p_hw_can)){
        return AM_CAN_INVALID_PARAMETER;
    }

    is_remote = ((p_txmsg->flags & AM_CAN_REMOTE_FLAG) ? AM_TRUE : AM_FALSE);
    is_extern = ((p_txmsg->flags & AM_CAN_EXTERN_FLAG) ? AM_TRUE : AM_FALSE);

    /* 8字节数据 */
    if (p_txmsg->msglen > 8) {
        p_txmsg->msglen = 8;
    }
    amhw_hc32f07x_can_txbuf_sel (p_hw_can,
                                 AMHW_HC32F07X_CAN_TXBUF_PTB);

    /* 扩展标识符 */
    if (is_extern) {

        /* 设置扩展标识符ID和IDE位 */
        p_hw_can->tbuf.tbuf0      = p_txmsg->id;
        p_hw_can->tbuf.txctrl.ide = 1;
    }else {

        /* 设置标准标识符ID和IDE位 */
        p_hw_can->tbuf.tbuf0      = p_txmsg->id;
        p_hw_can->tbuf.txctrl.ide = 0;
    }

    /* 远程标志 */
    if (is_remote) {

        /* 远程帧 */
        p_hw_can->tbuf.txctrl.rtr = 1;
    }else {

        /* 数据帧 */
        p_hw_can->tbuf.txctrl.rtr = 0;
    }

    /* 写入数据长度 */
    p_hw_can->tbuf.txctrl.dlc = p_txmsg->msglen;

    /* 写入数据 */
    p_hw_can->tbuf.tbuf2 = p_txmsg->msgdata[3] << 24 |
                           p_txmsg->msgdata[2] << 16 |
                           p_txmsg->msgdata[1] << 8  |
                           p_txmsg->msgdata[0];
    p_hw_can->tbuf.tbuf3 = p_txmsg->msgdata[7] << 24 |
                           p_txmsg->msgdata[6] << 16 |
                           p_txmsg->msgdata[5] << 8  |
                           p_txmsg->msgdata[4];


    /* 发送请求 */
    if(can_type == AMHW_HC32F07X_CAN_PTB){

        /* PTB发送请求 */
        amhw_hc32f07x_can_ptb_send_enable(p_hw_can);
    }else {

        /* STB发送请求 */
        if(p_txmsg->flags & AM_CAN_ONCE_SEND_FLAG){
            amhw_hc32f07x_can_stb_sendone_enable(p_hw_can);
        }else {
            amhw_hc32f07x_can_stb_sendall_enable(p_hw_can);
        }
    }

    return AM_CAN_NOERROR;
}

/**
 * \brief 接收信息
 */
am_can_err_t __can_hc32f07x_msg_recv (void *p_drv, am_can_message_t *p_rxmsg)
{
    am_hc32f07x_can_dev_t       *p_dev    = (am_hc32f07x_can_dev_t *)p_drv;
    amhw_hc32f07x_can_t         *p_hw_can = NULL;

    if (NULL == p_drv || NULL == p_rxmsg) {
        return AM_CAN_INVALID_PARAMETER;
    }

    p_hw_can = (amhw_hc32f07x_can_t *)p_dev->p_devinfo->regbase;

    /* 初始化 */
    p_rxmsg->id     = 0;
    p_rxmsg->flags  = 0;
    p_rxmsg->msglen = 0;

    /* 判断接收缓冲区是否为空 */
    if (amhw_hc32f07x_can_get_rxbuf_status (p_hw_can)  == 
                                           AMHW_HC32F07X_CAN_RXBUF_FULL ) {
            return AM_CAN_NOERROR;
        }

    if (p_hw_can->rbuf.cst.ide == AMHW_HC32F07X_CAN_IDE_EXTENDED) {

        /* 使用扩展标识符  */
        p_rxmsg->flags |= AM_CAN_EXTERN_FLAG;

        /* 获取ID */
        p_rxmsg->id     = p_hw_can->rbuf.rbuf0;

    } else {
        /* 使用标准标识符  */

        /* 获取ID */
        p_rxmsg->id     = p_hw_can->rbuf.rbuf0;
    }

    /* 远程帧处理 */
    if (p_hw_can->rbuf.cst.rtr == AMHW_HC32F07X_CAN_RTR_REMOTE) {

        /* 远程帧 */
        p_rxmsg->flags |= AM_CAN_REMOTE_FLAG;
        p_rxmsg->msglen = 0;
    }

        /* 获取发送数据长度*/
    p_rxmsg->msglen = (uint8_t)0x0f &
                       p_hw_can->rbuf.cst.dlc;

