zlgopen/ametal/soc/hdsc/drivers/source/can/am_hc32f07x_can.c
    p_rxmsg->msgdata[3] = (uint8_t)0xff &
                              p_hw_can->rbuf.rbuf2>>24;
    p_rxmsg->msgdata[2] = (uint8_t)0xff &
                              p_hw_can->rbuf.rbuf2>>16;
    p_rxmsg->msgdata[1] = (uint8_t)0xff &
                              p_hw_can->rbuf.rbuf2>>8;
    p_rxmsg->msgdata[0] = (uint8_t)0xff &
                              p_hw_can->rbuf.rbuf2;

    p_rxmsg->msgdata[7] = (uint8_t)0xff &
                              p_hw_can->rbuf.rbuf3>>24;
    p_rxmsg->msgdata[6] = (uint8_t)0xff &
                              p_hw_can->rbuf.rbuf3>>16;
    p_rxmsg->msgdata[5] = (uint8_t)0xff &
                              p_hw_can->rbuf.rbuf3>>8;
    p_rxmsg->msgdata[4] = (uint8_t)0xff &
                              p_hw_can->rbuf.rbuf3;
 
    /* 释放接收BUF */
    amhw_hc32f07x_can_rxbuf_release (p_hw_can);

    return AM_CAN_NOERROR;
}

/**
 * \brief 停止发送信息
 */
am_can_err_t __can_hc32f07x_stop_msg_snd (void *p_drv)
{
    am_hc32f07x_can_dev_t    *p_dev            = (am_hc32f07x_can_dev_t *)p_drv;
    amhw_hc32f07x_can_t      *p_hw_can         = NULL;
    if (NULL == p_drv) {
        return AM_CAN_INVALID_PARAMETER;
    }

    p_hw_can = (amhw_hc32f07x_can_t *)p_dev->p_devinfo->regbase;

    if(p_dev->p_devinfo->type == AMHW_HC32F07X_CAN_PTB){
        amhw_hc32f07x_can_ptb_abort_enable (p_hw_can);	
    }else {
        amhw_hc32f07x_can_stb_abort_enable (p_hw_can);
    }

    return AM_CAN_NOERROR;
}

/**
 * \brief 设置滤波函数(扩展)
 */
am_can_err_t __can_hc32f07x_filter_tab_ext_set (void              *p_drv,
                                              am_can_filter_t   *p_filterbuff,
                                              size_t             lenth)
{
    am_hc32f07x_can_dev_t         *p_dev    = (am_hc32f07x_can_dev_t *)p_drv;
    amhw_hc32f07x_can_t           *p_hw_can = NULL;
    uint8_t                      filt_num = 0;
    uint8_t                     filt_pos = 0;
    uint32_t                     id       = 0;
    uint32_t                     id_mask  = 0;
    am_can_err_t                 state    = AM_CAN_NOERROR;
    int                           i = 0;
    if (NULL == p_drv || NULL == p_filterbuff || 0 == lenth || (lenth > 8)) {
        return AM_CAN_INVALID_PARAMETER;
    }

    p_hw_can = (amhw_hc32f07x_can_t *)p_dev->p_devinfo->regbase;

    amhw_hc32f07x_can_reset_set(p_hw_can);
		
    for ( i = 0; i < lenth; i++) {

        /* 滤波器组号  */
        filt_num = i;

        if (filt_num > 7 ) {
            /* 跳出当前 */
            state = AM_CAN_ILLEGAL_CHANNEL_NO;
            break;
        } else {
            /* 滤波器组 */
            filt_pos = (uint8_t)(1ul << filt_num);
        }

        /* 禁用滤波器  */
        p_hw_can->acfen &= ~(uint32_t)filt_pos;

        if(p_filterbuff->ide == AM_CAN_FRAME_TYPE_STD){
            id      = (p_filterbuff->id[0] & 0x7ff);
            id_mask = (p_filterbuff->mask[0] & 0x7ff);
        }else {
            id      = (p_filterbuff->id[0] & 0x1fffffff);
            id_mask = (p_filterbuff->mask[0] & 0x1fffffff);
        }	

        amhw_hc32f07x_can_filter_addr (p_hw_can,
                                       filt_num);

        if (p_filterbuff->ide == AM_CAN_FRAME_TYPE_STD) {

            /* 只接收标准帧 */
            amhw_hc32f07x_can_ide_set (p_hw_can,
                                       AMHW_HC32F07X_CAN_AIDE_STD);
        }else if(p_filterbuff->ide == AM_CAN_FRAME_TYPE_EXT) {
            amhw_hc32f07x_can_ide_set (p_hw_can,
                                       AMHW_HC32F07X_CAN_AIDE_EXT);
        }else {
            state = AM_CAN_INVALID_PARAMETER;
            return state;
        }
        /* 滤波器id设置 */
        amhw_hc32f07x_can_acf_select_set (p_hw_can, 
                                          AMHW_HC32F07X_CAN_ACF_ID);
        amhw_hc32f07x_can_filter_code_set (p_hw_can, id);

        /* 滤波器mask设置 */
        amhw_hc32f07x_can_acf_select_set (p_hw_can, 
                                          AMHW_HC32F07X_CAN_ACF_ID);
        amhw_hc32f07x_can_filter_code_set (p_hw_can, id_mask);

        /* 激活滤波器  */
            p_hw_can->acfen |= (uint32_t)filt_pos;

        /* 滤波器组后移 */
        p_filterbuff++;
    }

    /* 切换到正常模式 */
    amhw_hc32f07x_can_reset_clr(p_hw_can);

    return state;
}


/**
 * \brief 获取滤波函数
 */
am_can_err_t __can_hc32f07x_filter_tab_ext_get (void              *p_drv,
                                              am_can_filter_t   *p_filterbuff,
                                              size_t            *p_lenth)
{
    am_hc32f07x_can_dev_t         *p_dev    = (am_hc32f07x_can_dev_t *)p_drv;
    amhw_hc32f07x_can_t           *p_hw_can = NULL;
    uint8_t                     filter_group = 0;
    int                         i = 0;
    if (NULL == p_drv ) {
        return AM_CAN_INVALID_PARAMETER;
    }


    p_hw_can = (amhw_hc32f07x_can_t *)p_dev->p_devinfo->regbase;

    filter_group = p_hw_can->acfen & 0xff;

    for (i = 0;i < 8;i++) {

        /* 判断当前滤波器组是否激活 */
        if ( ( filter_group & ( (uint8_t)1ul<< i) ) ) {
            *p_lenth = *p_lenth + 1;
        } else {
            continue;
        }

        uint16_t reg_f_ide     = p_hw_can->acf >> 29;
        uint16_t reg_f_id      = p_hw_can->acf & 0x1fffffff;
        uint16_t reg_f_id_mask = p_hw_can->acf & 0x1fffffff;

        /* 帧格式 帧类型 */
        p_filterbuff->ide = (reg_f_ide & 0x01) ?
                            AM_CAN_FRAME_TYPE_EXT :
                            AM_CAN_FRAME_TYPE_STD;

        p_filterbuff->rtr = AM_CAN_FRAME_FORMAT_NOCARE;

        /* 扩展帧 */
        if (p_filterbuff->ide == AM_CAN_FRAME_TYPE_EXT) {
            p_filterbuff->id[0]   = (reg_f_id );
            p_filterbuff->mask[0] = (reg_f_id_mask );
        } else {
           /* 标准帧 */
           p_filterbuff->id[0]   = reg_f_id & 0x7ff;
           p_filterbuff->mask[0] = reg_f_id_mask & 0x7ff;
        }

        p_filterbuff++;
    }
    return AM_CAN_NOERROR;
}


