zlgopen/ametal/soc/hdsc/drivers/source/can/am_hc32f07x_can.c
static void __can_hc32f07x_intcb_func_run (am_hc32f07x_can_dev_t  *p_dev,
                                        am_can_int_type_t      can_int)
{
    uint32_t      temp      = (uint32_t)can_int;
    am_pfnvoid_t  intcb_fun = NULL;
    void         *intcb_arg = NULL;
    uint8_t       i = 0;

    if ((NULL == p_dev) || (AM_CAN_INT_ALL == can_int)) {
        return ;
    }

    while (temp >> 1) {
        i++;
        temp = temp >> 1;
    }

    intcb_fun = p_dev->p_devinfo->p_intcb_info[i].pfn_callback;
    intcb_arg = p_dev->p_devinfo->p_intcb_info[i].p_arg;

    if (NULL != intcb_fun) {
        intcb_fun(intcb_arg);
    }
}

/**
 * \brief can中断服务函数
 */
static void __can_hc32f07x_int_handle (void *p_drv)
{
    am_hc32f07x_can_dev_t    *p_dev     = (am_hc32f07x_can_dev_t *)p_drv;
    amhw_hc32f07x_can_t      *p_hw_can  = NULL;

    if (NULL == p_drv) {
        return;
    }

    p_hw_can = (amhw_hc32f07x_can_t *)p_dev->p_devinfo->regbase;


    /* 接收中断产生，并且rxfifo不为空 */
    if (amhw_hc32f07x_can_get_irq_status (p_hw_can,
                                          AMHW_HC32F07X_CAN_FLAG_RECV)) {

        /* 执行接收回调函数 */
        __can_hc32f07x_intcb_func_run(p_dev, AM_CAN_INT_RX);

        /* 标志清除 */
        amhw_hc32f07x_can_irq_status_clr (p_hw_can,
                                          AMHW_HC32F07X_CAN_FLAG_RECV);
    }

    /* 发送中断产生，并且发送完成 */
    if (amhw_hc32f07x_can_get_irq_status (p_hw_can,
                           AMHW_HC32F07X_CAN_FLAG_TX_PTB)||
        amhw_hc32f07x_can_get_irq_status (p_hw_can,
                           AMHW_HC32F07X_CAN_FLAG_TX_STB)) {

        /* 执行发送回调函数 */
        __can_hc32f07x_intcb_func_run(p_dev, AM_CAN_INT_TX);

        /* 标志清除 */
        amhw_hc32f07x_can_irq_status_clr (p_hw_can,
                                          AMHW_HC32F07X_CAN_FLAG_TX_PTB);
        amhw_hc32f07x_can_irq_status_clr (p_hw_can,
                                          AMHW_HC32F07X_CAN_FLAG_TX_STB);
    }

    /* 数据溢出中断产生 */
    if (amhw_hc32f07x_can_get_irq_status (p_hw_can,
                           AMHW_HC32F07X_CAN_FLAG_RX_OVER))  {

        /* 执行数据溢出中断回调函数 */
        __can_hc32f07x_intcb_func_run(p_dev, AM_CAN_INT_DATAOVER);

        amhw_hc32f07x_can_irq_status_clr (p_hw_can,
                                          AMHW_HC32F07X_CAN_FLAG_RX_OVER);
    }

    /* 错误被动中断 */
    if (amhw_hc32f07x_can_get_irq_status (p_hw_can,
                                        AMHW_HC32F07X_CAN_ERR_FLAG_PASSIVE)) {

        /* 执行警告中断回调函数 */
        __can_hc32f07x_intcb_func_run(p_dev, AM_CAN_INT_ERROR_PASSIVE);

        amhw_hc32f07x_can_irq_status_clr (p_hw_can,
                                          AMHW_HC32F07X_CAN_ERR_FLAG_PASSIVE);
    }

    /* 错误中断、总线错误中断、总线仲裁丢失处理 */
    if (amhw_hc32f07x_can_get_irq_status (p_hw_can,
                                          AMHW_HC32F07X_CAN_FLAG_ERROR) ||
        amhw_hc32f07x_can_get_irq_status (p_hw_can,
                                        AMHW_HC32F07X_CAN_ERR_FLAG_ARBILOST) ||
        amhw_hc32f07x_can_get_irq_status (p_hw_can,
                                        AMHW_HC32F07X_CAN_ERR_FLAG_BUS_ERR) ) {

        /* 判断总线是否离线 */
        if (amhw_hc32f07x_can_status_get (p_hw_can, 
                                       AMHW_HC32F07X_CAN_FLAG_BUSOFF_ACTIVE)) {

            /* 执行总线关闭中断回调函数 */
            __can_hc32f07x_intcb_func_run(p_dev, AM_CAN_INT_BUS_OFF);

            amhw_hc32f07x_can_err_status_clr (p_hw_can,
                                          AMHW_HC32F07X_CAN_ERR_FLAG_BUS_ERR);
        } else {

           /* 执行错误中断回调函数 */
            __can_hc32f07x_intcb_func_run(p_dev, AM_CAN_INT_ERROR);

            amhw_hc32f07x_can_irq_status_clr (p_hw_can,
                                          AMHW_HC32F07X_CAN_FLAG_ERROR);
            amhw_hc32f07x_can_err_status_clr (p_hw_can,
                                          AMHW_HC32F07X_CAN_ERR_FLAG_ARBILOST);
        }
    }
}

/**
 * \brief CAN 状态
 */
am_can_err_t __can_hc32f07x_status_get (void              *p_drv,
                               am_can_int_type_t *p_int_type,
                               am_can_bus_err_t  *p_bus_err)
{
    am_hc32f07x_can_dev_t    *p_dev    = (am_hc32f07x_can_dev_t *)p_drv;
    amhw_hc32f07x_can_t      *p_hw_can = NULL;
    uint8_t                 err      = 0;  /* 错误寄存器值 */

    if (NULL == p_drv || NULL == p_int_type || NULL == p_bus_err) {
        return AM_CAN_INVALID_PARAMETER;
    }

    p_hw_can = (amhw_hc32f07x_can_t *)p_dev->p_devinfo->regbase;

    *p_int_type = 0;

    /* 接收中断 */
    if (amhw_hc32f07x_can_get_irq_status (p_hw_can,
                                          AMHW_HC32F07X_CAN_FLAG_RECV)) {

        *p_int_type |= AM_CAN_INT_RX;
    }

    /* 发送中断 */
    if (amhw_hc32f07x_can_get_irq_status (p_hw_can,
                                          AMHW_HC32F07X_CAN_FLAG_TX_PTB) ||
        amhw_hc32f07x_can_get_irq_status (p_hw_can,
                                          AMHW_HC32F07X_CAN_FLAG_TX_STB)) {
        *p_int_type |= AM_CAN_INT_TX;
    }

    /* 数据溢出中断 */
    if (amhw_hc32f07x_can_get_irq_status (p_hw_can,
                                          AMHW_HC32F07X_CAN_FLAG_RX_OVER)) {

        *p_int_type |= AM_CAN_INT_DATAOVER;
    }

    /* 错误中断、总线错误中断、总线仲裁丢失中断 */
    if (amhw_hc32f07x_can_get_irq_status (p_hw_can,
                                          AMHW_HC32F07X_CAN_FLAG_ERROR) ||
        amhw_hc32f07x_can_get_irq_status (p_hw_can,
                                   AMHW_HC32F07X_CAN_ERR_FLAG_ARBILOST) ||
        amhw_hc32f07x_can_get_irq_status (p_hw_can,
                                    AMHW_HC32F07X_CAN_ERR_FLAG_PASSIVE) ||
        amhw_hc32f07x_can_get_irq_status (p_hw_can,
                                    AMHW_HC32F07X_CAN_ERR_FLAG_BUS_ERR) ||
        amhw_hc32f07x_can_get_irq_status (p_hw_can,
                                    AMHW_HC32F07X_CAN_ERR_FLAG_EWARN))  {

