zlgopen/ametal/soc/hdsc/drivers/source/can/am_hc32f07x_can.c
        *p_int_type |= AM_CAN_INT_ERROR;

        /* 判断是否是因为错误计数器达到限制而引起的总线关闭 */
        if (amhw_hc32f07x_can_status_get (p_hw_can, 
                                  AMHW_HC32F07X_CAN_FLAG_BUSOFF_ACTIVE)) {
            *p_int_type |= AM_CAN_INT_BUS_OFF;
        }

        /* 判断是否是因为错误计数器达到限制而引起的错误警告 */
        if (amhw_hc32f07x_can_get_err_status (p_hw_can,
                                 AMHW_HC32F07X_CAN_ERR_FLAG_EWARN)) {
            *p_int_type |= AM_CAN_INT_WARN;
        }

        /* 判断是否是因为错误计数器达到限制而引起的错误被动 */
        if (amhw_hc32f07x_can_get_irq_status (p_hw_can,
                           AMHW_HC32F07X_CAN_ERR_FLAG_PASSIVE)) {
            *p_int_type |= AM_CAN_INT_ERROR_PASSIVE;
        }
    }

    /* 从寄存器获取错误代码 */
    *p_bus_err = 0;
    err        = amhw_hc32f07x_can_error_status_get (p_hw_can );

    /* 格式错误 */
    if (AMHW_HC32F07X_CAN_ERROR_FORM == err) {
        *p_bus_err |= AM_CAN_BUS_ERR_FORM;
    }

    /* 填充错误 */
    if (AMHW_HC32F07X_CAN_ERROR_STUFF == err) {
        *p_bus_err |= AM_CAN_BUS_ERR_STUFF;
    }

    /* 未知错误     显性错误   隐性错误  由软件设置错误*/
    if (AMHW_HC32F07X_CAN_ERROR_UNKOWN  == err) {
        *p_bus_err |= AM_CAN_BUS_ERR_UNKNOWN;
    }
		
		/* 位错误 */
    if (AMHW_HC32F07X_CAN_ERROR_BIT == err) {
        *p_bus_err |= AM_CAN_BUS_ERR_BIT;
    }

    /* ACK错误 */
    if (err == AMHW_HC32F07X_CAN_ERROR_ACK) {
        *p_bus_err |= AM_CAN_BUS_ERR_ACK;
    }

    /* CRC错误 */
    if (err == AMHW_HC32F07X_CAN_ERROR_CRC) {
        *p_bus_err |= AM_CAN_BUS_ERR_CRC;
    }

    return AM_CAN_NOERROR;
}

/**
 * \brief 中断连接
 */
am_can_err_t __can_hc32f07x_connect (void         *p_drv,
                            am_pfnvoid_t  pfn_isr,
                            void         *p_arg)
{
    am_hc32f07x_can_dev_t    *p_dev    = (am_hc32f07x_can_dev_t *)p_drv;

    if (NULL == p_drv) {
        return AM_CAN_INVALID_PARAMETER;
    }

    if (NULL != pfn_isr) {
        /* 连接传入函数 */
        am_int_connect(p_dev->p_devinfo->int_num, pfn_isr, p_arg);
    } else {
        /* 连接默认函数 */
        am_int_connect(p_dev->p_devinfo->int_num, __can_hc32f07x_int_handle, p_dev);

    }

    return AM_CAN_NOERROR;
}

/**
 * \brief 删除中断连接
 */
am_can_err_t __can_hc32f07x_disconnect (void         *p_drv,
                                        am_pfnvoid_t  pfn_isr,
                                        void         *p_arg)
{
    am_hc32f07x_can_dev_t    *p_dev    = (am_hc32f07x_can_dev_t *)p_drv;

    if (NULL == p_drv) {
        return AM_CAN_INVALID_PARAMETER;
    }

    /* 中断禁能 */
    am_int_disable(p_dev->p_devinfo->int_num);

    if (NULL != pfn_isr) {
        /* 删除连接函数 */
        am_int_disconnect(p_dev->p_devinfo->int_num, pfn_isr, p_arg);

    } else {
        /* 删除连接函数 */
        am_int_disconnect(p_dev->p_devinfo->int_num, __can_hc32f07x_int_handle, p_dev);

    }

    return AM_CAN_NOERROR;
}

/**
 * \brief 中断回调函数的连接
 */
am_can_err_t __can_hc32f07x_intcb_connect (void              *p_drv,
                                  am_can_int_type_t  inttype,
                                  am_pfnvoid_t       pfn_callback,
                                  void              *p_arg)
{
    am_hc32f07x_can_dev_t    *p_dev    = (am_hc32f07x_can_dev_t *)p_drv;
    uint8_t  i = 0;

    if (NULL == p_drv) {
        return AM_CAN_INVALID_PARAMETER;
    }

    while (inttype >> 1) {
        i++;
        inttype = inttype >> 1;
    }

    if (i >= p_dev->p_devinfo->p_intcb_num) {
        return AM_CAN_INVALID_PARAMETER;
    }

    p_dev->p_devinfo->p_intcb_info[i].pfn_callback = pfn_callback;
    p_dev->p_devinfo->p_intcb_info[i].p_arg        = p_arg;

    return AM_CAN_NOERROR;
}

/**
 * \brief 删除中断回调函数的连接
 */
am_can_err_t __can_hc32f07x_intcb_disconnect (void              *p_drv,
                                            am_can_int_type_t  inttype)
{
    am_hc32f07x_can_dev_t    *p_dev    = (am_hc32f07x_can_dev_t *)p_drv;
    uint8_t  i = 0;

    if (NULL == p_drv) {
        return AM_CAN_INVALID_PARAMETER;
    }

    while (inttype >> 1) {
        i++;
        inttype = inttype >> 1;
    }

    if (i >= p_dev->p_devinfo->p_intcb_num) {
        return AM_CAN_INVALID_PARAMETER;
    }

    p_dev->p_devinfo->p_intcb_info[i].pfn_callback = NULL;
    p_dev->p_devinfo->p_intcb_info[i].p_arg        = NULL;

    return AM_CAN_NOERROR;
}

/**
 * \brief  CAN初始化
 */
am_can_handle_t am_hc32f07x_can_init (am_hc32f07x_can_dev_t      *p_dev,
                               const am_hc32f07x_can_devinfo_t *p_devinfo)
{
    uint8_t             i = 0;

    if (NULL == p_dev || NULL == p_devinfo) {
        return NULL;
    }

    if (p_devinfo->pfn_plfm_init) {
        p_devinfo->pfn_plfm_init();
    }

    p_dev->p_devinfo = p_devinfo;

    p_dev->handle.p_drv_funcs = &__hc32f07x_can_dev_func;
    p_dev->handle.p_drv       = (void *)p_dev;

    for (i = 0 ; i < p_devinfo->p_intcb_num ; i++) {
        p_devinfo->p_intcb_info[i].pfn_callback = NULL;
        p_devinfo->p_intcb_info[i].p_arg        = NULL;
    }

    return (am_can_handle_t)&(p_dev->handle);
}

/**
 * \brief 解初始化
 */
void am_hc32f07x_can_deinit (am_can_handle_t handle)
{
    amhw_hc32f07x_can_t *p_hw_can = NULL;
    am_hc32f07x_can_dev_t  *p_dev = (am_hc32f07x_can_dev_t *)handle->p_drv;

    if (NULL == p_dev) {
        return;
    }

    p_hw_can = (amhw_hc32f07x_can_t *)p_dev->p_devinfo->regbase;

    amhw_hc32f07x_can_reset_set(p_hw_can);

    if (p_dev->p_devinfo->pfn_plfm_deinit) {
        p_dev->p_devinfo->pfn_plfm_deinit();
    }

    /* 中断禁能 */
    am_int_disable(p_dev->p_devinfo->int_num);

}

/* end of file */
